Tekla.Structures.Model.Internal.ContourOperation
ContourOperation provides methods to get contour geometry from TeklaStructures.

Tekla.Structures.Model.Internal.ContourOperation.GetPartContour(Tekla.Structures.Identifier)
Get contour geometry using the PartId
PartId: part identifier
Returns: Polycurve instance or null if geometry could not be fetched.

Tekla.Structures.Model.Internal.ContourOperation.GetPolycurveFromContourPoints(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t})
GetPolycurveFromContourPoints converts the given contour points (section points) to a polycurve.
DotContourPoints: contour points
Returns: Polycurve instance (empty if the conversion fails).